In [1]:
data = {"name": ["Sophia", "John", "Jennifer", "Edgar", "Patrick"],
       "gender": ["F", "M", "F", "M", "M"],
       "country": ["Bulgaria", "USA", "USA", "England", "Netherlands"],
       "age": [23, 24, 46, 13, 72]}

In [2]:
data

{'age': [23, 24, 46, 13, 72],
 'country': ['Bulgaria', 'USA', 'USA', 'England', 'Netherlands'],
 'gender': ['F', 'M', 'F', 'M', 'M'],
 'name': ['Sophia', 'John', 'Jennifer', 'Edgar', 'Patrick']}

In [3]:
import pandas as pd

In [14]:
df = pd.DataFrame(data)
df

   age      country gender      name
0   23     Bulgaria      F    Sophia
1   24          USA      M      John
2   46          USA      F  Jennifer
3   13      England      M     Edgar
4   72  Netherlands      M   Patrick

In [15]:
df.to_csv('small_data.csv', index=False)

In [7]:
df.columns

Index(['age', 'country', 'gender', 'name'], dtype='object')

In [8]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [9]:
df.set_index('name', drop=True, inplace=True)

In [10]:
df

          age      country gender
name
Sophia     23     Bulgaria      F
John       24          USA      M
Jennifer   46          USA      F
Edgar      13      England      M
Patrick    72  Netherlands      M

In [13]:
df.reset_index(inplace=False, drop=False)

       name  age      country gender
0    Sophia   23     Bulgaria      F
1      John   24          USA      M
2  Jennifer   46          USA      F
3     Edgar   13      England      M
4   Patrick   72  Netherlands      M